Revit 2024 API
BuiltInFailures.EditingFailures.CannotEditEditingElements Property
 Can't obtain permission to edit the element: The Central Model is inaccessible and another user is editing the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotEditEditingElements { get; }
Visual Basic
Public Shared ReadOnly Property CannotEditEditingElements As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotEditEditingElements {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace